#include "seq/seq_demo.h"
#include "dolphin/ai.h"
#include "dolphin/dvd.h"
#include "dolphin/gx/GXCull.h"
#include "dolphin/gx/GXGeometry.h"
#include "dolphin/gx/GXGet.h"
#include "dolphin/gx/GXLighting.h"
#include "dolphin/gx/GXPixel.h"
#include "dolphin/gx/GXStruct.h"
#include "dolphin/gx/GXTev.h"
#include "dolphin/gx/GXTexture.h"
#include "dolphin/gx/GXTransform.h"
#include "dolphin/gx/GXVert.h"
#include "dolphin/mtx.h"
#include "dolphin/os.h"
#include "manager/dvdmgr.h"

typedef struct THPHeader {
    char magic[4];             // 0x0
    u32 version;               // 0x4
    u32 bufSize;               // 0x8
    u32 audioMaxSamples;       // 0xC
    f32 frameRate;             // 0x10
    u32 numFrames;             // 0x14
    u32 firstFrameSize;        // 0x18
    u32 movieDataSize;         // 0x1C
    u32 compInfoDataOffsets;   // 0x20
    u32 offsetDataOffsets;     // 0x24
    u32 movieDataOffsets;      // 0x28
    u32 finalFrameDataOffsets; // 0x2C
} THPHeader;

#define THP_COMP_MAX 16

typedef struct THPFrameCompInfo {
    u32 numComponents;          // 0x0
    u8 frameComp[THP_COMP_MAX]; // 0x4
} THPFrameCompInfo;

typedef struct THPVideoInfo {
    u32 xSize;     // 0x0
    u32 ySize;     // 0x4
    u32 videoType; // 0x8
} THPVideoInfo;

typedef struct THPAudioInfo {
    u32 sndChannels;   // 0x0
    u32 sndFrequency;  // 0x4
    u32 sndNumSamples; // 0x8
    u32 sndNumTracks;  // 0xC
} THPAudioInfo;

typedef struct THPReadBuffer {
    u8* ptr;               // 0x0
    s32 frameNumber;       // 0x4
    volatile BOOL isValid; // 0x8
} THPReadBuffer;

typedef struct THPTextureSet {
    u8* ytexture;    // 0x0
    u8* utexture;    // 0x4
    u8* vtexture;    // 0x8
    s32 frameNumber; // 0xC
} THPTextureSet;

typedef struct THPAudioBuffer {
    s16* buffer;     // 0x0
    s16* curPtr;     // 0x4
    u32 validSample; // 0x8
} THPAudioBuffer;

#define READ_BUFFER_NUM 10
#define AUDIO_BUFFER_NUM 3

typedef struct THPSimple {
    DVDEntry* fileInfo;                           // 0x0
    THPHeader header;                             // 0x4
    THPFrameCompInfo compInfo;                    // 0x34
    THPVideoInfo videoInfo;                       // 0x48
    THPAudioInfo audioInfo;                       // 0x54
    void* thpWork;                                // 0x64
    BOOL open;                                    // 0x68
    u8 preFetchState;                             // 0x6C
    u8 audioState;                                // 0x6D
    u8 loop;                                      // 0x6E
    u8 audioExist;                                // 0x6F
    s32 curOffset;                                // 0x70
    BOOL dvdError;                                // 0x74
    volatile u32 readProgress;                    // 0x78
    s32 nextDecodeIndex;                          // 0x7C
    s32 readIndex;                                // 0x80
    s32 readSize;                                 // 0x84
    s32 totalReadFrame;                           // 0x88
    f32 curVolume;                                // 0x8C
    f32 targetVolume;                             // 0x90
    f32 deltaVolume;                              // 0x94
    s32 rampCount;                                // 0x98
    THPReadBuffer readBuffer[READ_BUFFER_NUM];    // 0x9C
    THPTextureSet textureSet;                     // 0x114
    THPAudioBuffer audioBuffer[AUDIO_BUFFER_NUM]; // 0x124
    s32 audioDecodeIndex;                         // 0x148
    s32 audioOutputIndex;                         // 0x14C
} THPSimple;

#define SAMPLES_PER_AUDIO_FRAME 160 // 5ms @ 32khz
#define BYTES_PER_AUDIO_FRAME (SAMPLES_PER_AUDIO_FRAME * sizeof(s16) * 2)

// clang-format off
//.data
// 32768 * ((vol * vol) / (127 * 127)) 
static u16 VolumeTable[] = {
        0,     2,     8,    18,    32,    50,    73,    99,
      130,   164,   203,   245,   292,   343,   398,   457,
      520,   587,   658,   733,   812,   895,   983,  1074,
     1170,  1269,  1373,  1481,  1592,  1708,  1828,  1952,
     2080,  2212,  2348,  2488,  2632,  2781,  2933,  3090,
     3250,  3415,  3583,  3756,  3933,  4114,  4298,  4487,
     4680,  4877,  5079,  5284,  5493,  5706,  5924,  6145,
     6371,  6600,  6834,  7072,  7313,  7559,  7809,  8063,
     8321,  8583,  8849,  9119,  9394,  9672,  9954, 10241,
    10531, 10826, 11125, 11427, 11734, 12045, 12360, 12679,
    13002, 13329, 13660, 13995, 14335, 14678, 15025, 15377,
